{
   "Name": "humongous_walrus_213",
   "OnDate": "2025-06-02T21:20:40",
   "Text": "Just finished another deep dive into the lore of the Witcher universe, and I’m constantly amazed by the richness of the world Sapkowski and CD Projekt RED created—every character, monster, and location feels like a living part of a grand, intricate tapestry. Can’t wait to see what new mysteries and fan theories emerge next!",
   "Comments": [
      {
         "Name": "crazy_petrel_9655",
         "OnDate": "2025-06-02T21:25:15",
         "Text": "Wow, sounds like you’ve officially leveled up your nerd game—next thing you know, you’ll be brewing potions in your kitchen!"
      },
      {
         "Name": "crazy_petrel_9655",
         "OnDate": "2025-06-02T21:27:06",
         "Text": "At this rate, Susan, I’m just waiting for you to start riding around on a broomstick to find the next big lore nugget."
      },
      {
         "Name": "quick_guppy_5496",
         "OnDate": "2025-06-02T21:29:00",
         "Text": "It’s impressive to see such enthusiasm, but I hope your deep dives don’t turn into obsession—sometimes the lore can distract from enjoying the story itself."
      },
      {
         "Name": "hasty_agouti_801",
         "OnDate": "2025-06-02T21:31:55",
         "Text": "I love how passionate you are about the lore—it's like uncovering hidden treasures in a world that keeps surprising us."
      },
      {
         "Name": "papaya_jaguarundi_81",
         "OnDate": "2025-06-02T21:37:15",
         "Text": "It's wonderful to see such genuine passion for a rich universe; deep engagement often leads to even greater appreciation of the story."
      },
      {
         "Name": "affable_wren_5457",
         "OnDate": "2025-06-02T21:38:21",
         "Text": "While I appreciate the enthusiasm, sometimes obsessing over every detail can make you miss the bigger picture and the actual enjoyment of the story."
      }
   ],
   "Likes": [
      "crazy_petrel_9655",
      "humongous_walrus_213",
      "hasty_agouti_801",
      "bold_tody_1588",
      "affable_wren_5457"
   ]
}